[
    {
        "id": "1",
        "title": "مطور React",
        "type": "دوام كامل",
        "description": "نحن نبحث عن مطور واجهة أمامية موهوب للانضمام إلى فريقنا في بوسطن، ماساتشوستس. يجب أن يكون لدى المرشح المثالي مهارات قوية في HTML و CSS و JavaScript، مع خبرة في العمل مع أطر JavaScript الحديثة مثل React أو Angular.",
        "location": "بوسطن، ماساتشوستس",
        "salary": "$70K - $80K",
        "company_name": "NewTek Solutions",
        "company_description": "NewTek Solutions هي شركة رائدة في مجال التكنولوجيا متخصصة في تطوير الويب والحلول الرقمية. نحن نفخر بتقديم منتجات وخدمات عالية الجودة لعملائنا مع تعزيز بيئة عمل تعاونية ومبتكرة.",
        "company_email": "contact@teksolutions.com",
        "company_phone": "555-555-5555"
    },
    {
        "id": "2",
        "title": "مهندس واجهة أمامية (React & Redux)",
        "type": "دوام كامل",
        "location": "ميامي، فلوريدا",
        "description": "انضم إلى فريقنا كمطور واجهة أمامية في ميامي المشمسة، فلوريدا. نحن نبحث عن فرد متحمس لديه شغف بصنع تطبيقات ويب جميلة ومتجاوبة. الخبرة في مبادئ تصميم واجهة المستخدم وتجربة المستخدم والانتباه الشديد للتفاصيل مرغوبة للغاية.",
        "salary": "$70K - $80K",
        "company_name": "Veneer Solutions",
        "company_description": "Veneer Solutions هي وكالة إبداعية متخصصة في التصميم والتطوير الرقمي. فريقنا مكرس لدفع حدود الإبداع والابتكار لتقديم نتائج استثنائية لعملائنا.",
        "company_email": "contact@loremipsum.com",
        "company_phone": "555-555-5555"
    },
    {
        "id": "3",
        "title": "مطور React.js",
        "type": "دوام كامل",
        "description": "نحن نبحث عن مطور React.js موهوب للانضمام إلى فريقنا في سان فرانسيسكو، كاليفورنيا. يجب أن يكون لدى المرشح المثالي خبرة في تطوير تطبيقات الويب باستخدام React.js وفهم عميق لمبادئ تصميم الواجهة الأمامية.",
        "location": "سان فرانسيسكو، كاليفورنيا",
        "salary": "$80K - $90K",
        "company_name": "Tech Innovators",
        "company_description": "Tech Innovators هي شركة تكنولوجيا مبتكرة تركز على تطوير حلول برمجية متقدمة. نحن نؤمن بأهمية الابتكار والتعاون في تحقيق النجاح.",
        "company_email": "contact@techinnovators.com",
        "company_phone": "555-555-5555"
    },
    {
        "id": "4",
        "title": "مطور واجهة أمامية React",
        "type": "دوام جزئي",
        "description": "انضم إلى فريقنا كمطور واجهة أمامية بدوام جزئي في فينيكس الجميلة، أريزونا. نحن نبحث عن فرد ذو دافع ذاتي ولديه شغف بإنشاء تجارب مستخدم جذابة. هذه الوظيفة توفر ساعات مرنة وفرصة للعمل عن بعد.",
        "location": "فينيكس، أريزونا",
        "salary": "$60K - $70K",
        "company_name": "Alpha Elite",
        "company_description": "Alpha Elite هي شركة ناشئة ديناميكية متخصصة في التسويق الرقمي وتطوير الويب. نحن ملتزمون بتعزيز بيئة عمل متنوعة وشاملة حيث يزدهر الإبداع والابتكار.",
        "company_email": "contact@adipisicingelit.com",
        "company_phone": "555-555-5555"
    },
    {
        "id": "5",
        "title": "مطور React متكامل",
        "type": "دوام كامل",
        "description": "فرصة مثيرة لمطور واجهة أمامية بدوام كامل في أتلانتا الصاخبة، جورجيا. نحن نبحث عن فرد موهوب لديه شغف ببناء تطبيقات ويب أنيقة وقابلة للتوسع. انضم إلى فريقنا واصنع تأثيرًا!",
        "location": "أتلانتا، جورجيا",
        "salary": "$90K - $100K",
        "company_name": "Browning Technologies",
        "company_description": "Browning Technologies هي شركة تكنولوجيا سريعة النمو متخصصة في حلول التجارة الإلكترونية. نحن نقدم بيئة عمل ديناميكية وتعاونية حيث يتم تشجيع الموظفين على التفكير بإبداع وابتكار.",
        "company_email": "contact@consecteturadipisicing.com",
        "company_phone": "555-555-5555"
    },
    {
        "id": "6",
        "title": "مطور React Native",
        "type": "دوام كامل",
        "description": "نحن نبحث عن مطور React Native موهوب للانضمام إلى فريقنا في نيويورك، نيويورك. يجب أن يكون لدى المرشح المثالي خبرة في تطوير تطبيقات الهاتف المحمول باستخدام React Native وفهم عميق لمبادئ تصميم الواجهة الأمامية.",
        "location": "نيويورك، نيويورك",
        "salary": "$85K - $95K",
        "company_name": "Mobile Innovators",
        "company_description": "Mobile Innovators هي شركة تكنولوجيا مبتكرة تركز على تطوير حلول برمجية متقدمة لتطبيقات الهاتف المحمول. نحن نؤمن بأهمية الابتكار والتعاون في تحقيق النجاح.",
        "company_email": "contact@mobileinnovators.com",
        "company_phone": "555-555-5555"
    }
]
